tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "koekeishiya/formulae"
tap "johanhaleby/kubetail"

cask_args appdir: "/Applications"

brew "coreutils"
brew "diffutils"
brew "direnv"
brew "findutils"
brew "zsh"
brew "zsh-completions"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "grep"
brew "jq"
brew "fd"
brew "mas"
# brew "python"
brew "golang"
brew "rename"
brew "rsync"
# brew "starship"
brew "tree"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "tldr"
brew "noti"

# Work
brew "krew"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "kubetail"
brew "azure-cli"

# brew "koekeishiya/formulae/skhd"
# brew "koekeishiya/formulae/yabai"

# Casks
cask "google-chrome"
cask "iterm2"
cask "yakyak"
cask "mark-text"
# cask "alacritty"
cask "docker"
cask "firefox"
cask "font-hack"
cask "font-hack-nerd-font"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "mediaelch"
cask "iina"
# cask "disk-inventory-x"

